app/controllers/store_controller.rb

  def add_to_cart

    begin
      product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2010-08-17 13:56:27', 1, 1, 1, 29.95, '2010-08-17 13:56:27')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('王海兵', '北京海淀区', '2010-08-17 13:56:27', '2010-08-17 13:56:27', 'check', 'ww@sina.com')